publish/history api vs hash.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-26 Thu 00:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vue Router 为什么切换路由不刷新页面</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/theindex.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Vue Router 为什么切换路由不刷新页面</h1>
<p>
之前一直使用 <a href="https://router.vuejs.org/">Vue Router</a>， 编写路由以及路由对应的组件。
</p>

<p>
当 URL 命中配置的路由时，就会渲染对应的组件，并且页面不会重载。
</p>

<p>
为什么页面不会重载呢？
</p>

<p>
在网页上浏览时，往往点击一个链接，都会把当前页整个刷新成新的页面。
</p>

<p>
而使用 <a href="https://router.vuejs.org/">Vue Router</a> 去配置路由却不会，为什么呢？
</p>

<p>
经过一些查阅，Vue Router 默认是 hash 模式。
</p>

<p>
利用 hash 变化不会造成浏览器刷新的特性，实现路由变化不刷新页面的功能。
</p>

<blockquote>
<p>
The default mode for vue-router is hash mode - it uses the URL hash
to simulate a full URL so that the page won't be reloaded when the
URL changes.
</p>
</blockquote>

<p>
当路由变化的时候，使用 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Location/hash">location.hash</a> 改变 URL，监听 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Window/hashchange_event">hashchange</a> 事件。
</p>

<p>
当发现 hash 变化时，找到匹配的路由，渲染对应的组件。
</p>

<p>
不过 hash 模式的一个问题是，会让 URL 看起来比较奇怪，后面有很长的 hash。
</p>

<p>
如果想 URL 不带有 hash，Vue Router 还提供了一种 history 模式。
</p>

<p>
利用 <a href="https://developer.mozilla.org/en-US/docs/Web/API/History">History API</a> 的 <a href="https://developer.mozilla.org/en-US/docs/Web/API/History/pushState">History.pushState()</a> 方法，也可以实现改变 URL 但不造成页面重载。
</p>

<p>
使用 History 模式，当 URL 变化时，使用 History.pushState 改变 URL，监听 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Window/popstate_event">popstate</a> 事件，处理路由变化。
</p>

<p>
但是使用 History 模式，由于改变了 URL，又因为是 <a href="https://en.wikipedia.org/wiki/Single-page_application">SPA</a>， 应用里只有一个 index.html。
</p>

<p>
如果此时页面刷新，浏览器就会尝试通过当前的 URL 去查找页面，但服务器上实际并没有这么一个资源存在，就会出现 404 的页面。
</p>

<p>
为了避免这个问题，就需要配置服务器，当根据 URL 找不到资源的时候，就回退到 index.html。
</p>

<p>
例如这是 <a href="https://router.vuejs.org/guide/essentials/history-mode.html#nginx">nginx</a> 的配置:
</p>
<div class="org-src-container">
<pre class="src src-bash">location / <span style="color: #000000;">{</span>
  try_files $<span style="color: #005e8b;">uri</span> $<span style="color: #005e8b;">uri</span>/ /index.html;
<span style="color: #000000;">}</span>
</pre>
</div>

<p>
如果没有 Vue Router 这些库，要实现 URL 变化页面变化。
</p>

<p>
一种是使用 MPA 应用，每个 URL 对应到一个 html 上，每次都刷新页面更新。
</p>

<p>
另一种就是 SPA 的方案，使用 hash 或者 History API，改变 URL，然后监听变化事件，去渲染对应内容。
</p>
</div>
<div id="postamble" class="status">

<p class="author">Author: Spike Leung (<a href="mailto:l-yanlei@hotmail.com">l-yanlei@hotmail.com</a>)</p>
<p class="date">Date: 2022-01-30T22:58:38+08:00</p>
</div>
</body>
</html>
